; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-1-1-4-174)
	(:domain driverlog)
	(:objects
	driver1 - driver
	truck1 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p3-0 - location
	p3-2 - location
	p5-3 - location
	p0-2 - location
	p4-0 - location
	p4-5 - location
	p6-1 - location
	p6-2 - location
	p6-5 - location
	)
	(:init
	(at driver1 s6)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at package1 s0)
	(at package2 s2)
	(at package3 s0)
	(at package4 s0)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 8)
	(= (time-to-walk p3-0 s3) 8)
	(= (time-to-walk s0 p3-0) 38)
	(= (time-to-walk p3-0 s0) 38)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 61)
	(= (time-to-walk p3-2 s3) 61)
	(= (time-to-walk s2 p3-2) 42)
	(= (time-to-walk p3-2 s2) 42)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 10)
	(= (time-to-walk p5-3 s5) 10)
	(= (time-to-walk s3 p5-3) 14)
	(= (time-to-walk p5-3 s3) 14)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 14)
	(= (time-to-walk p0-2 s0) 14)
	(= (time-to-walk s2 p0-2) 21)
	(= (time-to-walk p0-2 s2) 21)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 60)
	(= (time-to-walk p4-0 s4) 60)
	(= (time-to-walk s0 p4-0) 38)
	(= (time-to-walk p4-0 s0) 38)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 4)
	(= (time-to-walk p4-5 s4) 4)
	(= (time-to-walk s5 p4-5) 23)
	(= (time-to-walk p4-5 s5) 23)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 54)
	(= (time-to-walk p6-1 s6) 54)
	(= (time-to-walk s1 p6-1) 57)
	(= (time-to-walk p6-1 s1) 57)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 7)
	(= (time-to-walk p6-2 s6) 7)
	(= (time-to-walk s2 p6-2) 39)
	(= (time-to-walk p6-2 s2) 39)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(= (time-to-walk s6 p6-5) 41)
	(= (time-to-walk p6-5 s6) 41)
	(= (time-to-walk s5 p6-5) 30)
	(= (time-to-walk p6-5 s5) 30)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 20)
	(= (time-to-drive s3 s1) 20)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 21)
	(= (time-to-drive s4 s1) 21)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 25)
	(= (time-to-drive s1 s2) 25)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 4)
	(= (time-to-drive s2 s6) 4)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 23)
	(= (time-to-drive s4 s6) 23)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 2)
	(= (time-to-drive s5 s6) 2)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 60)
	(= (time-to-drive s2 s4) 60)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 15)
	(= (time-to-drive s5 s4) 15)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 21)
	(= (time-to-drive s4 s3) 21)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 4)
	(= (time-to-drive s5 s3) 4)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 20)
	(= (time-to-drive s1 s0) 20)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 47)
	(= (time-to-drive s3 s0) 47)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 53)
	(= (time-to-drive s5 s0) 53)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 63)
	(= (time-to-drive s6 s0) 63)
	(= (fuel-used) 0)
)
	(:goal (and
	(at truck1 s0)
	(at package1 s2)
	(at package2 s5)
	(at package3 s1)
	(at package4 s0)
	))

(:metric minimize (+ (* 1 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (walk driver1 s6 p6-2)
   deleted: (at driver1 s6)
   added: (at driver1 p6-2)
   goals met: 1 of 5
2. (walk driver1 p6-2 s2)
   deleted: (at driver1 p6-2)
   added: (at driver1 s2)
   goals met: 1 of 5
3. (walk driver1 s2 p3-2)
   deleted: (at driver1 s2)
   added: (at driver1 p3-2)
   goals met: 1 of 5
4. (walk driver1 p3-2 s3)
   deleted: (at driver1 p3-2)
   added: (at driver1 s3)
   goals met: 1 of 5
5. (board-truck driver1 truck1 s3)
   deleted: (at driver1 s3) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 1 of 5
6. (drive-truck truck1 s3 s0 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 0 to 470
   goals met: 2 of 5
7. (load-truck package1 truck1 s0)
   deleted: (at package1 s0)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 5
8. (load-truck package3 truck1 s0)
   deleted: (at package3 s0)
   added: (in package3 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 2 of 5
9. (drive-truck truck1 s0 s1 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 470 to 730
   goals met: 1 of 5
10. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 2 of 5
11. (drive-truck truck1 s1 s2 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (fuel-used) from 730 to 1005
   goals met: 2 of 5
12. (unload-truck package1 truck1 s2)
   deleted: (in package1 truck1)
   added: (at package1 s2)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 3 of 5
13. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 3 of 5
14. (drive-truck truck1 s2 s6 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (fuel-used) from 1005 to 1049
   goals met: 3 of 5
15. (drive-truck truck1 s6 s5 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   changed: (fuel-used) from 1049 to 1071
   goals met: 3 of 5
16. (unload-truck package2 truck1 s5)
   deleted: (in package2 truck1)
   added: (at package2 s5)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 4 of 5
17. (drive-truck truck1 s5 s0 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   changed: (fuel-used) from 1071 to 1601
   goals met: 5 of 5
